In [10]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt 
from sklearn.linear_model import LinearRegression
import warnings
warnings.filterwarnings('ignore')

In [11]:
df = pd.read_csv('F:\\full practise\Machine Learning practise set\\hiring.csv')
df

  experience  test score ()  interview score  salary
0        NaN            8.0                9   50000
1        NaN            8.0                6   45000
2      five             6.0                7   60000
3        two           10.0               10   65000
4      seven            9.0                6   70000
5      three            7.0               10   62000
6       ten             NaN                7   72000
7     eleven            7.0                8   80000

Performing EDA

In [12]:
df.isna().sum()

experience         2
test score ()      1
interview score    0
salary             0
dtype: int64

In [15]:
df.experience.replace({
    'five ' : 5,
    'two' : 2,
    'seven' : 7,
    'ten ' : 10,
    'three' : 3,
    'eleven' : 11, 
}, inplace= True)
df

   experience  test score ()  interview score  salary
0         NaN            8.0                9   50000
1         NaN            8.0                6   45000
2         5.0            6.0                7   60000
3         2.0           10.0               10   65000
4         7.0            9.0                6   70000
5         3.0            7.0               10   62000
6        10.0            NaN                7   72000
7        11.0            7.0                8   80000

In [16]:
df['experience'].fillna(0,inplace = True)
df['test score ()'].fillna(df['test score ()'].median(), inplace= True)
df

   experience  test score ()  interview score  salary
0         0.0            8.0                9   50000
1         0.0            8.0                6   45000
2         5.0            6.0                7   60000
3         2.0           10.0               10   65000
4         7.0            9.0                6   70000
5         3.0            7.0               10   62000
6        10.0            8.0                7   72000
7        11.0            7.0                8   80000

In [18]:
categorical_features = df.drop('salary', axis=1)
target = df.salary

In [20]:
categorical_features.shape

(8, 3)

In [22]:
target.shape

(8,)

Building Linear Regression Model

In [23]:
lr = LinearRegression()
lr.fit(categorical_features, target)
lr.score(categorical_features, target)

0.9616780002577959

In [24]:
lr.predict([[10,10,10]])

array([86376.27365357])